/*
	模块：NTFS结构
	作者：denglf
	日期：2019-04-24
	说明：
	参考：
	https://sourceforge.net/projects/linux-ntfs/
	https://sourceforge.net/projects/ntfs-3g/
*/

#ifndef __NTFS_H__
#define __NTFS_H__

#include <windows.h>

/*
	Everything on an NTFS volume is a file. 
	There are two categories: Metadata and Normal. 
	The Metadata files contain information about the volume and the Normal files contain your data.
	NTFS卷上的一切都是文件。
	分成两类: 元数据文件和普通文件。
	元数据文件包含关于卷的信息，而普通文件则包含您的数据。

	Below is a table of files found on a Win2K volume (Key).
	下面是在Win2K卷(Key)上的文件表结构：
	Inode 	Filename	OS 	Description
	0 		$MFT 	  		Master File Table - An index of every file
	1 		$MFTMirr 	  	A backup copy of the first 4 records of the MFT
	2 		$LogFile 	  	Transactional logging file
	3 		$Volume 	  	Serial number, creation time, dirty flag
	4 		$AttrDef 	  	Attribute definitions
	5 		.(dot) 	  		Root directory of the disk
	6 		$Bitmap 	  	Contains volume's cluster map (in-use vs. free)
	7 		$Boot 	  		Boot record of the volume
	8 		$BadClus 	  	Lists bad clusters on the volume
	9 		$Quota 		NT 	Quota information
	9 		$Secure 	2K 	Security descriptors used by the volume
	10 		$UpCase 	  	Table of uppercase characters used for collating
	11 		$Extend 	2K 	A directory: $ObjId, $Quota, $Reparse, $UsnJrnl

	12-15 	<Unused> 	  	Marked as in use but empty
	16-23 	<Unused> 	  	Marked as unused

	Any 	$ObjId		2K 	Unique Ids given to every file
	Any 	$Quota 		2K 	Quota information
	Any 	$Reparse 	2K 	Reparse point information
	Any 	$UsnJrnl 	2K 	Journalling of Encryption

	> 24 	A_File 	  		An ordinary file
	> 24 	A_Dir 	  		An ordinary directory
	... 	... 	  		...

	Note:
	For some reason $ObjId, $Quota, $Reparse and $UsnJrnl don't have inode numbers below 24, like the rest of the Metadata files.
	Also, the sequence number for each of the system files is always equal to their mft record number and it is never modified.
	注意：
	由于某种原因，$ObjId、$Quota、$Reparse和$UsnJrnl不像其他元数据文件一样，inode编号低于24。
	此外，每个系统文件的序列号总是等于它们的mft记录号，而且它从不修改。
*/

#pragma pack(push, 1)
/* 
	7
	$Boot
	Boot record of the volume

	$Boot is the system file that allows the system to boot. 
	This metadata file points at the boot sector of the volume. 
	It contains information about the size of the volume, clusters and the MFT. 
	It is the only file that cannot be relocated.
	$Boot是允许系统启动的系统文件。
	这个元数据文件指向卷的引导扇区。
	它包含关于卷大小、簇和MFT的信息。
	它是惟一不能重新定位的文件。

*/
typedef struct
{
	UCHAR		Jump[3];				// 0x0000 	3 	Jump to the boot loader routine 跳转到引导加载程序
	UCHAR		Format[8];				// 0x0003 	8 	System Id: "NTFS    "
	USHORT		BytesPerSector;			// 0x000B 	2 	Bytes per sector 每个扇区字节数
	UCHAR		SectorsPerCluster;		// 0x000D 	1 	Sectors per cluster 每簇扇区数 
	USHORT		BootSectors;			// 引导扇区数
	UCHAR		Mbz1;					// 保留0 
	USHORT		Mbz2;					// 保留0 
	USHORT		Reserved1;				// 保留0 
	UCHAR		MediaType;				// 0x0015 	1 	Media descriptor: A media descriptor of 0xF8 means a hard disk. 介质类型: 0xF8的媒体描述符表示硬盘。
	USHORT		Mbz3;					// 总为0 
	USHORT		SectorsPerTrack;		// 0x0018 	2 	Sectors per track 每磁道扇区数
	USHORT		NumberOfHeads;			// 0x001A 	2 	Number of heads 磁头数 
	ULONG		PartitionOffset;		// 该分区的偏移（即该分区前的隐含扇区数 一般为磁道扇区数0x3f 63） 
	ULONG		Rserved2;
	ULONG		Rserved3;				// 0x0024 	4 	Usually 80 00 80 00. A value of 80 00 00 00 has been seen on a USB thumb drive which is formatted with NTFS under Windows XP. Note this is removable media and is not partitioned, the drive as a whole is NTFS formatted. 在Windows XP下使用NTFS格式化的USB u盘上显示值为8000 00 00。注意，这是可移动媒体，没有分区，驱动器作为一个整体是NTFS格式。
	ULONGLONG	TotalSectors;			// 0x0028 	8 	Number of sectors in the volume. 该分区总扇区数
	ULONGLONG	MftStartLcn;			// 0x0030 	8 	LCN of VCN 0 of the $MFT. MFT表($MFT)的起始簇号LCN
	ULONGLONG	Mft2StartLcn;			// 0x0038 	8 	LCN of VCN 0 of the $MFTMirr. MFT备份表($MFTMirr)的起始簇号LCN 			
	ULONG		ClustersPerFileRecord;  // 0x0040 	4 	Clusters per MFT Record: This can be negative, which means that the size of the MFT record is smaller than a cluster. In this case the size of the MFT record in bytes is equal to 2^(-1 * Clusters per MFT record). So for example if Clusters per MFT Record is 0xF6 (-10 in decimal), the MFT record size is 2^(-1 * -10) = 2^10 = 1024 bytes. 每个MFT记录包含几个簇：记录的字节不一定为ClustersPerFileRecord*SectorsPerCluster*BytesPerSector。这可能是负的，这意味着MFT记录的大小小于簇。在本例中，以字节为单位的MFT记录的大小等于2^(-1 *Clusters per MFT记录)。因此，例如，如果每个MFT记录的集群是0xF6(十进制为-10)，那么MFT记录大小是2^(-1 * -10)= 2^10 = 1024字节。
	ULONG		ClustersPerIndexBlock;	// 0x0044 	4 	Clusters per Index Record: This can be negative, which means that the size of the Index record is smaller than a cluster. In this case the size of the Index record in bytes is equal to 2^(-1 * Clusters per Index record). So for example if Clusters per MFT Record is 0xF6 (-10 in decimal), the MFT record size is 2^(-1 * -10) = 2^10 = 1024 bytes. 每个索引块的簇数：这可能是负的，这意味着Index记录的大小小于簇。记录的字节不一定为：ClustersPerFileRecord*SectorsPerCluster*BytesPerSector。在本例中，以字节为单位的Index记录的大小等于2^(-1 *Clusters per Index记录)。因此，例如，如果每个MFT记录的集群是0xF6(十进制为-10)，那么MFT记录大小是2^(-1 * -10)= 2^10 = 1024字节。
	ULONGLONG	VolumeSerialNumber;		// 0x0048 	8 	Volume serial number 卷序列号
	UCHAR		Code[0x1AE];
	USHORT		BootSignature;
} BOOT_BLOCK, *PBOOT_BLOCK;				// 0x0200 	  	Windows NT Loader
#pragma pack(pop)


/*
	0 	
	$MFT 	  	
	Master File Table - An index of every file

	The MFT is a set of FILE records.
	Each file of the volume is completely described by one or more of these FILE Records.
	File Records are equivalent to inodes in Unix terminology.
	The first FILE Record that describes a given file is called the Base FILE record and the others are called Extension FILE Records.
	MFT是一组文件记录。
	卷中的每个文件都由一个或多个这样的文件记录完整地描述。
	在Unix术语中，文件记录相当于inode。
	描述给定文件的第一个文件记录称为基本文件记录，其他文件记录称为扩展文件记录。

	A FILE Record is built up from a header, several variable length attributes and an end marker (simply 0xFFFFFFFF).
	文件记录由一个头、几个可变长度属性和一个结束标记(简单地说就是0xFFFFFFFF)组成。

	The file record Layout is as follows
	文件记录布局如下：

		Record Header
		Attribute
		Attribute
		...
		End Marker (0xFFFFFFFF)


